[
  {
    "id": 1,
    "company_name": "EA Sports",
    "job_position": "Software Engineer",
    "date": "12/4/24",
    "status": "Applied",
    "role": "In your role as a Software Engineer, you will work with a team to build APIs and web applications to support teams within EAX. You will collaborate across departments ( Design, Engineering, QA, Project Management ) and other internal customers to align and implement. You will also be a regular consumer of data to analyze performance of our live service products and collaborate with our senior engineers to identify live service opportunities to create richer player experiences. You will report to the Engineering Manager as a core contributor to the EAX team based in EA Vancouver.",
    "duties": "Build testable modular components/features and debug live issues. Collaborate with other developers to promote the culture of performance, maintainability, quality and automation in the team. Collaborate across departments ( Design, Engineering, QA, Project Management ) and other internal customers to align and implement. Learn new technologies and apply new techniques to improve existing solutions",
    "requirements": "2+ years of experience in a technical role focused on development and operation of complex live services. Strong Javascript and Typescript experience. Familiarity with backend web technologies. Familiarity with databases. Experience with GraphQL, NodeJS, and Kubernetes is a plus. "
  },
  {
    "id": 2,
    "company_name": "Konrad",
    "job_position": "Jr. Frontend web developer",
    "date": "16/4/24",
    "status": "Applied",
    "role": "As an entry level Software Developer you'll be tasked with working on both mobile and web applications. Working within the software development team, your duties will require you to assist in the development of consumer and enterprise applications. This role is ideal for entry level developers who feel confident in their technical ability and want to be a part of the highly-skilled development team at Konrad.",
    "duties": "Write maintainable, testable, and performant software in collaboration with our world class team. Participate in code review and performing extensive testing to ensure high quality software.Research new technology and tools and share those findings with the team.Communicate clearly and effectively with all members of our team",
    "requirements": "Graduated from a Computer Science, Software Engineering, or similar program in a University or College. Strong command of important programming and computer science concepts. Ability to understand a web application and how it's built from end-to-end. Fundamental knowledge of core web principals (HTTP, the DOM, SSL, web servers. Fluency with databases (schema design, querying, optimization etc.). Great interpersonal skills - we work very closely together as a team and require a lot of communication. Proactive personality and a desire to deliver your best work."
  }
]
